# Data Cleaning

## Indicies of Deprivation 2015 Files

### File Refactoring:
I removed all empty spaces between the column headings in the "File_2_ID2015_Domains_of_deprivation.xlsx" file to make it easier to work with and renamed the file to "ID2015_Domains_of_deprivation.xlsa".

In [1]:
import pandas as pd

In [6]:
# Load file "Domains of Deprivation 2015" into dataframe

data = './data/Deprivation_Index/ID2015_Domains_of_deprivation.xlsx'
df = pd.read_excel(data, sheet_name='ID2015 Domains')

In [130]:
df.head(3)

NameError: name 'df' is not defined

In [8]:
list(df.columns)

['LSOA_code_2011',
 'LSOA_name_2011',
 'Local_Authority_District_code_2013',
 'Local_Authority_District_name_2013',
 'Index_of_Multiple_Deprivation_IMD_Rank',
 'Index_of_Multiple_Deprivation_IMD_Decile',
 'Income_Rank',
 'Income_Decile',
 'Employment_Rank',
 'Employment_Decile',
 'Education_Skills_and_Training_Rank',
 'Education_Skills_and_Training_Decile',
 'Health_Deprivation_and_Disability_Rank',
 'Health_Deprivation_and_Disability_Decile',
 'Crime_Rank',
 'Crime_Decile',
 'Barriers_to_Housing_and_Services_Rank',
 'Barriers_to_Housing_and_Services_Decile',
 'Living_Environment_Rank',
 'Living_Environment_Decile']

In [9]:
# Tell me more about the dataset
df_info = df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32844 entries, 0 to 32843
Data columns (total 20 columns):
 #   Column                                    Non-Null Count  Dtype
---  ------                                    --------------  -----
 0   LSOA_code_2011                            32844 non-null  object
 1   LSOA_name_2011                            32844 non-null  object
 2   Local_Authority_District_code_2013        32844 non-null  object
 3   Local_Authority_District_name_2013        32844 non-null  object
 4   Index_of_Multiple_Deprivation_IMD_Rank    32844 non-null  int64
 5   Index_of_Multiple_Deprivation_IMD_Decile  32844 non-null  int64
 6   Income_Rank                               32844 non-null  int64
 7   Income_Decile                             32844 non-null  int64
 8   Employment_Rank                           32844 non-null  int64
 9   Employment_Decile                         32844 non-null  int64
 10  Education_Skills_and_Training_Rank        32844 non-null  int64
 11  Education_Skills_and_Training_Decile      32844 non-null  int64
 12  Health_Deprivation_and_Disability_Rank    32844 non-null  int64
 13  Health_Deprivation_and_Disability_Decile  32844 non-null  int64
 14  Crime_Rank                                32844 non-null  int64
 15  Crime_Decile                              32844 non-null  int64
 16  Barriers_to_Housing_and_Services_Rank     32844 non-null  int64
 17  Barriers_to_Housing_and_Services_Decile   32844 non-null  int64
 18  Living_Environment_Rank                   32844 non-null  int64
 19  Living_Environment_Decile                 32844 non-null  int64
dtypes: int64(16), object(4)
memory usage: 5.0+ MB

In [10]:
# Descibe the dataset please
#pd.options.display.float_format = '{:,.2f}'.format # Only want to see 2 decimal places
df.describe()

,Index_of_Multiple_Deprivation_IMD_Rank,Index_of_Multiple_Deprivation_IMD_Decile,Income_Rank,Income_Decile,Employment_Rank,Employment_Decile,Education_Skills_and_Training_Rank,Education_Skills_and_Training_Decile,Health_Deprivation_and_Disability_Rank,Health_Deprivation_and_Disability_Decile,Crime_Rank,Crime_Decile,Barriers_to_Housing_and_Services_Rank,Barriers_to_Housing_and_Services_Decile,Living_Environment_Rank,Living_Environment_Decile
count,32844.000000,32844.000000,32844.000000,32844.000000,32844.000000,32844.000000,32844.000000,32844.000000,32844.000000,32844.000000,32844.000000,32844.000000,32844.000000,32844.000000,32844.000000,32844.000000
mean,16422.499391,5.500122,16422.498660,5.500122,16422.498873,5.500122,16422.499330,5.500122,16422.499726,5.500122,16422.499635,5.500122,16422.499208,5.500122,16422.499574,5.500122
std,9481.390618,2.872325,9481.390331,2.872325,9481.390246,2.872325,9481.390748,2.872325,9481.390467,2.872325,9481.390606,2.872325,9481.390574,2.872325,9481.390570,2.872325
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,8211.750000,3.000000,8211.750000,3.000000,8211.750000,3.000000,8211.750000,3.000000,8211.750000,3.000000,8211.750000,3.000000,8211.750000,3.000000,8211.750000,3.000000
50%,16422.500000,5.500000,16422.500000,5.500000,16422.500000,5.500000,16422.500000,5.500000,16422.500000,5.500000,16422.500000,5.500000,16422.500000,5.500000,16422.500000,5.500000
75%,24633.250000,8.000000,24633.250000,8.000000,24633.250000,8.000000,24633.250000,8.000000,24633.250000,8.000000,24633.250000,8.000000,24633.250000,8.000000,24633.250000,8.000000
max,32844.000000,10.000000,32844.000000,10.000000,32844.000000,10.000000,32844.000000,10.000000,32844.000000,10.000000,32844.000000,10.000000,32844.000000,10.000000,32844.000000,10.000000

In [11]:
# Who has the worst income in England?
df[df['Income_Rank'] == 1]

,LSOA_code_2011,LSOA_name_2011,Local_Authority_District_code_2013,Local_Authority_District_name_2013,Index_of_Multiple_Deprivation_IMD_Rank,Index_of_Multiple_Deprivation_IMD_Decile,Income_Rank,Income_Decile,Employment_Rank,Employment_Decile,Education_Skills_and_Training_Rank,Education_Skills_and_Training_Decile,Health_Deprivation_and_Disability_Rank,Health_Deprivation_and_Disability_Decile,Crime_Rank,Crime_Decile,Barriers_to_Housing_and_Services_Rank,Barriers_to_Housing_and_Services_Decile,Living_Environment_Rank,Living_Environment_Decile
2598,E01012673,Blackpool 010A,E06000009,Blackpool,2,1,1,1,10,1,47,1,12,1,10,1,24093,8,766,1

## Census data

### File Refactoring
File 85043238.csv : The file meta data was removed. The file name was changed to "NS_SeC_16_to_24.csv"

File 87985007.csv : The file meta data was removed. The file name was changed to "NS_SeC_25_to_49.csv"

File 91695374.csv : The file meta data was removed. The file name was changed to "NS_SeC_50_to_64.csv"

File 93917134.csv : The file meta data was removed. The file name was changed to "NS_SeC_65_to_over.csv"

In all four files the heading "2011 super output area - middle layer" was changed to MSOA_2011 and the heading "mnemonic" was changed to MSOA_code_2011. All empty spaces and dashes in the heading row waere replaced with underscores. Finally The empty row after the heading row was removed.

In [40]:
# Lets test to see if all our df are working fine.
df1 = pd.read_csv("./data/census/NS_SeC_16_to_24.csv")
df1.head(3)

,MSOA_2011,MSOA_code_2011,1.1_Large_employers_and_higher_managerial_and_administrative_occupations,1.2_Higher_professional_occupations,"2._Lower_managerial,_administrative_and_professional_occupations",3._Intermediate_occupations,4._Small_employers_and_own_account_workers,5._Lower_supervisory_and_technical_occupations,6._Semi_routine_occupations,7._Routine_occupations,L14.1_Never_worked,L14.2_Long_term_unemployed,L15_Full_time_students,L17_Not_classifiable_for_other_reasons
0,Darlington 001,E02002559,2,14,77,89,11,39,92,66,23,3,321,0
1,Darlington 002,E02002560,3,9,35,80,9,43,97,60,25,7,242,0
2,Darlington 003,E02002561,2,7,55,70,5,37,77,39,26,5,217,0

In [6]:
df2 = pd.read_csv("./data/census/NS_SeC_25_to_49.csv")
df2.head(3)

,MSOA_2011,MSOA_code_2011,1.1_Large_employers_and_higher_managerial_and_administrative_occupations,1.2_Higher_professional_occupations,"2._Lower_managerial,_administrative_and_professional_occupations",3._Intermediate_occupations,4._Small_employers_and_own_account_workers,5._Lower_supervisory_and_technical_occupations,6._Semi-routine_occupations,7._Routine_occupations,L14.1_Never_worked,L14.2_Long-term_unemployed,L15_Full-time_students,L17_Not_classifiable_for_other_reasons
0,Darlington 001,E02002559,145,408,1112,492,308,217,285,167,34,40,32,0
1,Darlington 002,E02002560,52,142,531,407,176,185,310,220,38,45,27,0
2,Darlington 003,E02002561,37,143,481,335,121,134,272,200,35,33,19,0

In [7]:
df3 = pd.read_csv("./data/census/NS_SeC_50_to_64.csv")
df3.head(3)

,MSOA_2011,MSOA_code_2011,1.1_Large_employers_and_higher_managerial_and_administrative_occupations,1.2_Higher_professional_occupations,"2._Lower_managerial,_administrative_and_professional_occupations",3._Intermediate_occupations,4._Small_employers_and_own_account_workers,5._Lower_supervisory_and_technical_occupations,6._Semi-routine_occupations,7._Routine_occupations,L14.1_Never_worked,L14.2_Long-term_unemployed,L15_Full-time_students,L17_Not_classifiable_for_other_reasons
0,Darlington 001,E02002559,75,179,503,240,281,99,180,134,14,18,3,0
1,Darlington 002,E02002560,28,42,212,179,124,95,244,189,11,16,5,0
2,Darlington 003,E02002561,55,81,327,266,116,122,264,186,8,23,3,0

In [8]:
df4 = pd.read_csv("./data/census/NS_SeC_65_to_over.csv")
df4.head(3)

,MSOA_2011,MSOA_code_2011,1.1_Large_employers_and_higher_managerial_and_administrative_occupations,1.2_Higher_professional_occupations,"2._Lower_managerial,_administrative_and_professional_occupations",3._Intermediate_occupations,4._Small_employers_and_own_account_workers,5._Lower_supervisory_and_technical_occupations,6._Semi-routine_occupations,7._Routine_occupations,L14.1_Never_worked,L14.2_Long-term_unemployed,L15_Full-time_students,L17_Not_classifiable_for_other_reasons
0,Darlington 001,E02002559,40.0,100.0,295.0,201.0,228.0,104.0,178.0,127.0,37.0,5.0,1.0,0.0
1,Darlington 002,E02002560,13.0,20.0,120.0,138.0,68.0,127.0,220.0,199.0,32.0,0.0,1.0,0.0
2,Darlington 003,E02002561,22.0,37.0,168.0,162.0,70.0,112.0,205.0,169.0,41.0,0.0,2.0,0.0

Lets look at the MSOAs with the highest number of students in the 16 to 24 age range.

In [72]:
students_16_24 = df1[["MSOA_2011", "L15_Full_time_students"]]
students_16_24.sort_values(["L15_Full_time_students"], ascending=False)

                MSOA_2011  L15_Full_time_students
5780           Oxford 008                    9581
2911       Birmingham 096                    9445
39      County Durham 030                    8378
1908            Leeds 110                    7236
7069          Cardiff 032                    7183
...                   ...                     ...
5217   West Berkshire 010                     124
6495       East Devon 012                     121
6622          Purbeck 005                     121
6555       South Hams 012                     111
6269  Isles of Scilly 001                      16

[7201 rows x 2 columns]

Now lets see the highest number of Higheer Professional occupation between the 25 to 49 age range

In [74]:
higher_professional_25_49 = df2[["MSOA_2011", "1.2_Higher_professional_occupations"]]
higher_professional_25_49.sort_values(["1.2_Higher_professional_occupations"], ascending=False)

                        MSOA_2011  1.2_Higher_professional_occupations
4272                Southwark 003                                 2448
4344               Wandsworth 010                                 1825
4330            Tower Hamlets 028                                 1772
5154                  Reading 011                                 1697
4342               Wandsworth 008                                 1659
...                           ...                                  ...
1308       Kingston upon Hull 002                                   23
2263             East Lindsey 006                                   22
1309       Kingston upon Hull 003                                   17
1344  North East Lincolnshire 006                                   17
1340  North East Lincolnshire 002                                   13

[7201 rows x 2 columns]

No clear connection there really.

Let add an extra column to the dataframe named Total that holds the total number of persons in each MSOA

In [90]:
df1["Total"] = df1.iloc[:, 2:13].sum(axis=1)
df1.head(1)

,MSOA_2011,MSOA_code_2011,1.1_Large_employers_and_higher_managerial_and_administrative_occupations,1.2_Higher_professional_occupations,"2._Lower_managerial,_administrative_and_professional_occupations",3._Intermediate_occupations,4._Small_employers_and_own_account_workers,5._Lower_supervisory_and_technical_occupations,6._Semi_routine_occupations,7._Routine_occupations,L14.1_Never_worked,L14.2_Long_term_unemployed,L15_Full_time_students,L17_Not_classifiable_for_other_reasons,Total
0,Darlington 001,E02002559,2,14,77,89,11,39,92,66,23,3,321,0,737

Lets look at the MSOA in Blackpool with the highest number of full time students and compare it with the Oxford.

In [128]:
blackpool = df1.loc[df1.MSOA_2011.str.contains("Blackpool")]
blackpool.sort_values(["L15_Full_time_students"], ascending=False).head(3)

,MSOA_2011,MSOA_code_2011,1.1_Large_employers_and_higher_managerial_and_administrative_occupations,1.2_Higher_professional_occupations,"2._Lower_managerial,_administrative_and_professional_occupations",3._Intermediate_occupations,4._Small_employers_and_own_account_workers,5._Lower_supervisory_and_technical_occupations,6._Semi_routine_occupations,7._Routine_occupations,L14.1_Never_worked,L14.2_Long_term_unemployed,L15_Full_time_students,L17_Not_classifiable_for_other_reasons,Total
366,Blackpool 009,E02002641,1,16,68,89,19,45,164,88,63,20,388,0,961
367,Blackpool 010,E02002642,2,5,47,46,19,36,175,156,134,41,367,0,1028
372,Blackpool 015,E02002647,1,13,48,84,26,59,188,109,84,14,362,0,988

In [129]:
oxford = df1.loc[df1.MSOA_2011.str.contains("Oxford")]
oxford.sort_values(["L15_Full_time_students"], ascending=False).head(3)

,MSOA_2011,MSOA_code_2011,1.1_Large_employers_and_higher_managerial_and_administrative_occupations,1.2_Higher_professional_occupations,"2._Lower_managerial,_administrative_and_professional_occupations",3._Intermediate_occupations,4._Small_employers_and_own_account_workers,5._Lower_supervisory_and_technical_occupations,6._Semi_routine_occupations,7._Routine_occupations,L14.1_Never_worked,L14.2_Long_term_unemployed,L15_Full_time_students,L17_Not_classifiable_for_other_reasons,Total
5780,Oxford 008,E02005947,0,30,58,42,10,16,46,48,36,9,9581,0,9876
5783,Oxford 011,E02005950,12,74,193,106,23,41,108,80,68,5,3860,0,4570
5778,Oxford 006,E02005945,0,61,116,60,10,38,76,54,36,5,2221,0,2677

Oxford 008 has almost 24 times the amount of full time students than Blackpool 009. That gap did surpirse me.
There is something fishy here. Lets look at the total number of MSOAs for each.

In [127]:
len(blackpool)

19

In [126]:
len(oxford)

53

That explains things. None of this is therefore useful.